/*Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

5 -> 2, 4
8 -> 2, 4, 6, 8*/

Console.WriteLine("Введите число, начиная с 1: ");
int N = int.Parse(Console.ReadLine()!);
int i = 2;
if(N < i){
   Console.WriteLine("В данном числовом промежутке нет четных чисел"); 
}
while(N >= i){
    Console.WriteLine(i);
    i+=2;
}
